# 1'. Задайте список из нескольких чисел. 
# Напишите программу, которая найдёт сумму элементов списка, 
# стоящих на нечётной позиции.
# *Пример:*
# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12


def sum_of_even(nums: list[int]) -> int: 
    return sum(nums[1::2])

a = [2, 3, 5, 9, 3, 5, 6, 8]
print(f"Задан список: {a}, на нечётных позициях элементы {a[1::2]}, их  сумма: {sum_of_even(a)}")